* Usage
There is a built-in help that you may find useful:
#+BEGIN_SRC shell :exports both :results verbatim replace
vaultsign --help
#+END_SRC

#+RESULTS:
#+begin_example
vaultsign 1.0.0
Martin Baillie <martin@baillie.email>
Sign/verify git commits using HashiCorp Vault.

USAGE:
    vaultsign [FLAGS] [OPTIONS] <--sign|--verify> [FILE]...

FLAGS:
    -a, --armor          Create ASCII armored output
    -b, --detach-sign    Make a detached signature
    -h, --help           Prints help information
    -s, --sign           Make a signature
    -V, --version        Prints version information
    -v, --verify         Verify a signature

OPTIONS:
        --keyid-format <keyid_format>           Select how to display key IDs [possible values: long]
    -u, --local-user <local_user>               USER-ID to sign or decrypt
        --status-fd <status_fd>                 Write special status strings to the file descriptor n. [possible values:
                                                1, 2]
        --vault_addr <vault_addr>               Vault address to use for sign and verify actions [env: VAULT_ADDR]
                                                [default: http://127.0.0.1:8200]
        --vault_sign_path <vault_sig_path>      The Vault path to use for sign actions [env: VAULT_SIGN_PATH]  [default:
                                                transit/sign/test/sha2-256]
        --vault_verify_path <vault_ver_path>    The Vault path to use for verify actions [env: VAULT_VERIFY_PATH]
                                                [default: transit/verify/test]

ARGS:
    <FILE>...

NOTE:
    The vaultsign CLI implements just enough of the full GPG CLI interface
    for happy-path git sign and verify operations to function correctly.
#+end_example

Mostly, though, you just need to tell your =git= CLI to use =vaultsign=:
#+BEGIN_SRC shell
git config --local gpg.program /path/to/vaultsign
#+END_SRC

And set some Vault related environment variables:
#+BEGIN_SRC shell
# The location of your Vault. Mandatory always.
export VAULT_ADDR=https://vault.your.corp:8200

# The signing backend endpoint (transit or gpg) and optionally hashing function
# to use. Mandatory for signing.
export VAULT_SIGN_PATH=transit/sign/test/sha2-256
export VAULT_SIGN_PATH=gpg/sign/test/sha2-256

# The verify backend endpoint (transit or gpg). Mandatory for verifying.
export VAULT_VERIFY_PATH=transit/verify/test
export VAULT_VERIFY_PATH=gpg/verify/test

# The SNI to present during the TLS handshake (if different from the Vault HTTP
# host name). Useful when your Vault is exposed through an AWS private link for
# example. Optional.
export VAULT_TLS_SERVER_NAME=hostname.to.use.for.sni.com
#+END_SRC

#+BEGIN_QUOTE
NOTE: =vaultsign= will discover an existing Vault token from either the
environment or the home directory using HashiCorp's established naming
(=VAULT_TOKEN=) and path (=~/.vault-token=). The environment takes precedence
here.
#+END_QUOTE

